In [18]:
import pandas as pd

In [19]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'math': [1, 2, 5, 3]})
df2 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'english': [5, 6, 10, 8]})
df3 = pd.DataFrame({'id2': ['A', 'B', 'C', 'D'],
                    'science': [7, 6, 10, 8]})

### merge: common id

In [20]:
same_id_merged=df1.merge(df2, on='id')
same_id_merged

  id  math  english
0  A     1        5
1  B     2        6
2  C     5       10
3  D     3        8

### merge: different id

In [21]:
diff_id_merged=df1.merge(df3, left_on='id', right_on='id2')
diff_id_merged

  id  math id2  science
0  A     1   A        7
1  B     2   B        6
2  C     5   C       10
3  D     3   D        8

### Sort

In [23]:
diff_id_merged.sort_values(by=['science'], inplace=True)
diff_id_merged

  id  math id2  science
1  B     2   B        6
0  A     1   A        7
3  D     3   D        8
2  C     5   C       10